---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementTag.Location
source: html/ac42ff31-d480-8b0e-4735-b5eb6ee1d53e.htm
---
# Autodesk.Revit.DB.SpatialElementTag.Location Property

The location of the tag.

## Syntax (C#)
```csharp
public override Location Location { get; }
```

## Remarks
Allows you to get and set the location of the tag within the level. The
Z location should be the elevation of the level and is not changeable.